In [26]:
import psycopg2
import pandas as pd

from sqlalchemy import create_engine
from datetime import datetime

## In this first step we're going to load the date in the memory, create a connection with our database, create our tables and load our data to the database

In [2]:
jobs_df = pd.read_csv("data/jobs.txt", delimiter="|")
categories_df = pd.read_csv("data/category.txt", delimiter="|")
conn_string = 'postgres://postgres:postgres@localhost:5431/levee_test'
db = create_engine(conn_string)
conn = db.connect()

In [3]:
def create_table():
    conn = psycopg2.connect(host="localhost", database="levee_test", user="postgres",
                         password="postgres", port="5431")
    
    queries = """
    CREATE TABLE IF NOT EXISTS jobs(
        partnerId SERIAL PRIMARY KEY,
        title VARCHAR(255) NOT NULL,
        categoryId SERIAL,
        ExpiresAt DATE,
        openPositionAmnt INTEGER     
    )
    """, 
    """
    CREATE TABLE IF NOT EXISTS category(
        id SERIAL PRIMARY KEY,
        name VARCHAR(255) NOT NULL
    """
    cursor = conn.cursor()
    try:
        for query in queries:
            cursor.execute(query)
        conn.commit()
    except (Exception, psycopg2.DatabaseError) as error:
        print("Error: %s" % error)
        conn.rollback()
        cursor.close()
        return 1
    cursor.close()

In [4]:
create_table()

In [5]:
jobs_df.to_sql('jobs', con=conn, if_exists='replace', index=False)
categories_df.to_sql('category', con=conn, if_exists='replace', index=False)

## Now that we have already loaded our data to the datebase is time to retrieve the data to answer the challange questions

In [10]:
def create_pandas_table(sql_query, database = conn):
    table = pd.read_sql_query(sql_query, database)
    return table

In [14]:
jobs_info = create_pandas_table("SELECT * FROM jobs ORDER BY title")
categories_info = create_pandas_table("SELECT * FROM category ORDER BY name")

In [17]:
jobs_info.head()

,partnerId,title,categoryId,ExpiresAt,openPositionAmnt
0,3001,Analista de Help Desk,1,23/9/2020,4
1,3197,Analista de Help Desk,1,1/4/2020,1
2,3112,Analista de Help Desk,1,3/3/2020,1
3,3387,Assistente Administrativo,2,22/1/2020,1
4,4190,Assistente Administrativo,2,21/9/2020,1

In [16]:
categories_info.head()

   id            name
0   2  Administrativo
1   4     Atendimento
2   1      Tecnologia
3   3          Vendas

In [18]:
df = jobs_info.join(categories_info.set_index('id'), on='categoryId')

In [20]:
df.head()

,partnerId,title,categoryId,ExpiresAt,openPositionAmnt,name
0,3001,Analista de Help Desk,1,23/9/2020,4,Tecnologia
1,3197,Analista de Help Desk,1,1/4/2020,1,Tecnologia
2,3112,Analista de Help Desk,1,3/3/2020,1,Tecnologia
3,3387,Assistente Administrativo,2,22/1/2020,1,Administrativo
4,4190,Assistente Administrativo,2,21/9/2020,1,Administrativo

In [24]:
# Solution 1

df_sum = df.groupby(['name']).sum()
open_positions = df_sum['openPositionAmnt']
print(f'The number of open positions per category name is: {open_positions}')

The number of open positions per category name is: name
Administrativo    17
Atendimento       36
Tecnologia         6
Vendas            18
Name: openPositionAmnt, dtype: int64

In [29]:
# Solution 2
date = datetime.today()

df['ExpiresAt'] = pd.to_datetime(df['ExpiresAt'])
expired_positions = (df.loc[df['ExpiresAt'] < date].sort_values('ExpiresAt').iloc[-3:])
print(f'The last three jobs that expired is: \n{expired_positions}')

The last three jobs that expired is:
    partnerId               title  categoryId  ExpiresAt  openPositionAmnt  \
43        909    Vendedor Externo           3 2020-12-16                 1
29       6899  Promotor de Vendas           3 2020-12-21                 1
17       4435          Office Boy           2 2020-12-25                 1

              name
43          Vendas
29          Vendas
17  Administrativo

![thatsall](https://media.giphy.com/media/upg0i1m4DLe5q/giphy.gif "thatsall")